<!DOCTYPE html>
<html lang="ru">
<head>
	<title>Задачи на пользовательские функции</title>
	<meta charset="utf-8">
</head>
<body>

<?php

	// Объявляем функцию с произвольным названием (в данном случае я использую название "sq") с единственным параметром (в данном случае в качестве такового я использую "$x"), в теле которого мы возвращаем результат выполнения арифметической операции (в данном случае по условию задачи - умножения числового значения на себя), после чего выводим в браузер нашу функцию, используя в качестве его единственного параметра произвольное числовое значение (в данном случае я выбрал число "4") (МОЙ СПОСОБ):
	function sq($x) {
		return $x*$x;
	}
	echo sq(4);
	
	// - (СПОСОБ АВТОРА):
	function func($num)
 	{
		return $num * $num;
	}
	
	// Объявляем функцию с произвольным названием (в данном случае я использую название "sum") с 2-мя параметрами (в данном случае в качестве таковых я использую "$x" и "$y"), в теле которого мы возвращаем результат выполнения арифметической операции (в данном случае по условию задачи - сложения числовых значений), после чего выводим в браузер нашу функцию, используя в качестве его 2-х параметров произвольные числовые значения (в данном случае я выбрал числа "35" и "17") (МОЙ СПОСОБ):
	function sum($x, $y) {
		return $x+$y;
	}
	echo sum(35, 17);
	
	// - (СПОСОБ АВТОРА):
	function func($a, $b)
	{
		return $a + $b;
	}
	
	// Объявляем функцию с произвольным названием (в данном случае я использую название "expression") с 3-мя параметрами (в данном случае в качестве таковых я использую "$x", "$y" и "$z"), в теле которого мы возвращаем результат выполнения арифметической операции (в данном случае по условию задачи - вычитания числового значения "$y" из числового значения "$x" с последующим делением полученного результата на числовое значене "$z"), после чего выводим в браузер нашу функцию, используя в качестве его 3-х параметров произвольные числовые значения (в данном случае я выбрал числа "6", "3" и "2") (МОЙ СПОСОБ):
	function expression($x, $y, $z) {
		return ($x-$y)/$z;
	}
	echo expression(6, 3, 2);
	
	// - (СПОСОБ АВТОРА):
	function func($a, $b, $c)
 	{
		return ($a - $b) / $c;
	}
	
	// Объявляем функцию с произвольным названием (в данном случае я использую название "day") с 1-м параметром (в данном случае в качестве такового я использую "$x"), в теле которого мы объявляем переменную "$week", в которую записываем строковый массив с днями недели на русском языке, далее возвращаем элемент массива, соответствующий выбранному ключу (при этом наш параметр и будет нашим ключом), после чего выводим в браузер нашу функцию, используя в качестве его единственного параметра произвольное числовое значение (в данном случае я выбрал число "6") (МОЙ СПОСОБ):
	function day($x) {
		$week = [1=>"Пн", 2=>"Вт", 3=>"Ср", 4=>"Чт", 5=>"Пт", 6=>"Сб", 7=>"Вс"];
		return $week[$x];
	}
	echo day(6);
	
	// - (СПОСОБ АВТОРА):
	function func($day)
 	{
		$week = [1=>'пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
		return $arr[$week];
	}
	
</body>
</html>