<!DOCTYPE html>
<html lang="ru">
<head>
	<title>Задачи на приёмы работы с циклами на PHP</title>
	<meta charset="utf-8">
</head>
<body>

<?php

	// Объявляем пустую строковую переменную "$str", далее объявляем цикл "for" с первоначальным счётчиком "1", максимальным числовым значением "9" и автоинкрементом на 1 единицу, в теле которого нашей пустой строке на каждой итерации присваиваем числа от "1" до "9" (МОЙ СПОСОБ (ПОЧТИ АНАЛОГИЧЕН СПОСОБУ АВТОРА)):
	$str = "";
	for ($i=1; $i<=9; $i++) {
		$str .= $i;
	}
	echo $str;
	
	// Объявляем пустую строковую переменную "$str", далее объявляем цикл "for" с первоначальным счётчиком "9", минимальным числовым значением "1" и автодекрементом на 1 единицу, в теле которого нашей пустой строке на каждой итерации присваиваем числа от "9" до "1" (МОЙ СПОСОБ):
	$str = "";
	for ($i=9; $i>=1; $i--) {
		$str .= $i;
	}
	echo $str;
	
	// - (СПОСОБ АВТОРА):
	$str = '';
	for ($i = 9; $i > 0; $i--) {
		$str .= $i;
	}
	echo $str;
	
	// Объявляем переменную "$str", в которую записываем "-", далее объявляем цикл "for" с первоначальным счётчиком "1", максимальным числовым значением "9" и автоинкрементом на 1 единицу, в теле которого нашей первоначальной строке на каждой итерации присваиваем счётчик цикла и "-" (МОЙ СПОСОБ):
	$str = "-";
	for ($i=1; $i<=9; $i++) {
		$str .= "$i-";
	}
	echo $str;
	
	// - (СПОСОБ АВТОРА):
	$str = '';
	for ($i = 1; $i <= 9; $i++) {
		$str .= '-' . $i;
	}
	echo $str . '-';
	
	// Объявляем пустую строковую переменную "$str", далее объявляем цикл "for" с первоначальным счётчиком "1", максимальным числовым значением "20" и автоинкрементом на 1 единицу, в теле которого нашей пустой строке на каждой итерации присваиваем подстроку "x", после чего выводим в браузер каждую итерацию с переносом строки (МОЙ СПОСОБ (АНАЛОГИЧЕН СПОСОБУ АВТОРА)):
	$str = "";
	for ($i=1; $i<=20; $i++) {
		$str .= "x";
		echo "$str<br>";
	}
	
	// Объявляем цикл "for" с первоначальным счётчиком "1", максимальным числовым значением "9" и автоинкрементом на 1 единицу, в теле которого объявляем другой цикл (подцикл) "for" с первоначальным счётчиком "1", максимальным числовым значением, соответствующим числовому значению счётчика главного цикла, и автоинкрементом на 1 единицу, в теле которого указываем вывод в браузер счётчик первоначального цикла, а после окончания подцикла указываем перенос строки (МОЙ СПОСОБ):
	нашей пустой строке на каждой итерации присваиваем подстроку "x", после чего выводим в браузер каждую итерацию с переносом строки (МОЙ СПОСОБ):
	for ($i=1; $i<=9; $i++) {
		for ($j=1; $j<=$i; $j++) {
			echo $i;
		}
		echo "<br>";
	}
	
	// - (СПОСОБ АВТОРА):
	for ($i = 1; $i <= 9; $i++) {
		$str = '';
		for ($j = 0; $j < $i; $j++) {
			$str .= $i;
		}
		echo $str.'<br>';
	}
	
	// Объявляем пустую строковую переменную "$str", далее объявляем цикл "for" с первоначальным счётчиком "1", максимальным числовым значением "5" и автоинкрементом на 1 единицу, в теле которого нашей пустой строке на каждой итерации присваиваем подстроку "xx", после чего выводим в браузер каждую итерацию с переносом строки (МОЙ СПОСОБ (АНАЛОГИЧЕН СПОСОБУ АВТОРА)):
	$str = "";
	for ($i=1; $i<=5; $i++) {
		$str .= "xx";
		echo "$str<br>";
	}
	
</body>
</html>