<!DOCTYPE html>
<html lang="ru">
<head>
	<title>Задачи на основы работы с массивами в PHP</title>
	<meta charset="utf-8">
</head>
<body>

<?php

	// объявляем переменную "$arr", в которую записываем массив "['a', 'b', 'c']" и выводим его в браузер с помощью команды "var_dump":
	$arr = ['a', 'b', 'c'];
	var_dump($arr)
	
	// объявляем переменную "$arr", в которую записываем массив "['a', 'b', 'c']" и выводим в браузер (в столбик) каждый его элемент:
	$arr = ['a', 'b', 'c'];
	echo $arr[0].'<br>';
	echo $arr[1].'<br>';
	echo $arr[2].'<br>';
	
	// объявляем переменную "$arr", в которую записываем массив "['a', 'b', 'c', 'd']" и выводим в браузер строку 'a+b, c+d':
	$arr = ['a', 'b', 'c', 'd'];
	echo $arr[0].'+'. $arr[1].', '.$arr[2].'+'.$arr[3];
	
	// объявляем переменную "$arr", в которую записываем массив "[2, 5, 'c', 'd']" и выводим в браузер строку 'a+b, c+d':
	$arr = [2, 5, 3, 9];
	$result = $arr[0] * $arr[1] + $arr[2] * $arr[3];
	echo $result;
	
	// объявляем переменные "$arr[]", в каждую из которых записываем числа от "1" до "5", после чего выводим в браузер конечный массив с помощью команды "var_dump":
	$arr[] = 1;
	$arr[] = 2;
	$arr[] = 3;
	$arr[] = 4;
	$arr[] = 5;
	var_dump($arr);
	
	// объявляем переменную "$arr", в которую записываем ассоциативный массив "'a'=>1, 'b'=>2, 'c'=>3", после чего выводим в браузер значение элемента массива с ключом 'c':
	$arr = ['a'=>1, 'b'=>2, 'c'=>3];
	echo $arr['c'];
	
	// объявляем переменную "$arr", в которую записываем ассоциативный массив "'a'=>1, 'b'=>2, 'c'=>3", после чего выводим в браузер сумму всех элементов (чисел) данного массива:
	$arr = ['a'=>1, 'b'=>2, 'c'=>3];
	echo $arr['a'] + $arr['b'] + $arr['c'];
	
	// объявляем переменную "$arr", в которую записываем ассоциативный массив "'Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'", после чего выводим в браузер строку, включающую в себя значения ключей 'Петя' и 'Коля':
	$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
	echo $arr['Петя'].' '.$arr['Коля'];
	
	// объявляем переменную "$arr", в которую записываем ассоциативный массив "1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'", после чего выводим в браузер значение элемента с ключом "4":
	$arr = [1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'];
	echo $arr[4];
	
	// объявляем переменную "$arr", в которую записываем ассоциативный массив "1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'", затем объявляем переменную "$day", в которую записываем элемент данного массива с ключом "3", после чего выводим в браузер значение этого элемента:
	$arr = [1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'];
	$day = 3;
	echo $arr[$day];
	
	// объявляем переменную "$arr", в которую записываем двумерный массив "'cms'=>['joomla', 'wordpress', 'drupal'], 'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']", после чего выводим в браузер ключи данного массива, содержащие значения "joomla", "drupal", "зеленый" и "красный":
	$arr = ['cms'=>['joomla', 'wordpress', 'drupal'], 'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']];
	echo $arr['cms'][0]; //joomla
	echo $arr['cms'][2] //drupal;
	echo $arr['colors']['green']; //зеленый
	echo $arr['colors']['red']; //красный
	
	// объявляем переменную "$arr", в которую записываем двумерный массив "'ru'=>[1=>'пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'], 'en'=>[1=>'mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn']", после чего выводим в браузер элементы данного массива, содержащие значения "пн" и "wd":
	$arr = ['ru'=>[1=>'пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'], 'en'=>[1=>'mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn']];
	echo $arr['ru'][1]; //пн
	echo $arr['en'][2]; //wd
	
	// объявляем переменную "$arr", в которую записываем двумерный массив "'ru'=>['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'], 'en'=>['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn']", затем объявляем переменные "$lang" и "$day", в которые записываем ключ 'ru' и число "3" соответственно, после чего выводим в браузер элемент данного массива, содержащий значение "ср":
	$arr = ['ru'=>['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'], 'en'=>['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn']];
	$lang = 'ru';
	$day = 3;
	echo $arr[$lang][$day]; //ср
	
?>

</body>
</html>