<!DOCTYPE html>
<html lang="ru">
<head>
	<title>Задачи на приёмы работы с флагами на PHP</title>
	<meta charset="utf-8">
</head>
<body>

<?php

	// Объявляем переменную "$arr", в которую записываем произвольный числовой массив, далее объявляем флаг-переменную "$flag", которой присваиваем булевское значение "false", далее объявляем массивный цикл "foreach", в теле которого объявляем условие (равенства значения переменной "$v" числовому значению "5") по конструкции "if-else", в теле которого переопределяем значение переменной "$flag" на "true" и выходим из цикла с использованием "break", далее объявляем ещё 1 условие (равенства переменной "$flag" булевскому значению "true") по конструкции "if-else", в теле которого мы объявляем вывод в браузер текста "Да!" в случае удовлетворения условию цикла, иначе - "Нет!" (МОЙ СПОСОБ):
	$arr = [1, 2, 3, 4, 5];
	$flag = false;
	foreach ($arr as $v) {
		if ($v == 5) {
			$flag = true;
			break;
		}
	}
	if ($flag == true) {
		echo "Да!";
	} else {
		echo "Нет!";
	}
	
	// - (СПОСОБ АВТОРА):
	$arr = [1, 4, 6, 10, 11, 5, 8];
	$flag = false;
	foreach ($arr as $elem) {
		if ($elem == 5) {
			$flag = true;
			break;
		}
	}
	if ($flag == true) {
		echo 'да';
	} else {
		echo 'нет';
	}
	
	// Объявляем переменную "$num", в которую записываем заявленное числовое значение, далее объявляем флаг-переменную "$flag", которой присваиваем булевское значение "false", далее объявляем цикл "for" (с условием, что первоначальное значение счётчика - 2, не превышает числовое значение переменной "$num" и после каждой итерации инкрементируется на 1 ед.), в теле которого объявляем условие (что значение переменной "$num" делится на счётчик цикла без остатка) по конструкции "if-else", в теле которого переопределяем значение переменной "$flag" на "true" и выходим из цикла с использованием "break", далее объявляем ещё 1 условие (равенства переменной "$flag" булевскому значению "true") по конструкции "if-else", в теле которого мы объявляем вывод в браузер текста 'да' в случае удовлетворения условию цикла, иначе - 'нет' (СПОСОБ АВТОРА):
	$num = 31;
	$flag = false;
	for ($i = 2; $i < $num; $i++) {
		if ($num % $i == 0) {
			$flag = true;
			break;
		}
	}
	if ($flag == true) {
		echo 'да';
	} else {
		echo 'нет';
	}
	
	// Объявляем переменную "$arr", в которую записываем произвольный числовой массив, далее объявляем флаг-переменную "$flag", которой присваиваем булевское значение "false", далее объявляем цикл "foreach" (с ключами), в теле которого объявляем условие (что ключ больше числового значения "0" И значение каждого элемента массива соответствует значению предыдущего элемента) по конструкции "if-else", в теле которого переопределяем значение переменной "$flag" на "true" и выходим из цикла с использованием "break", далее объявляем ещё 1 условие (равенства переменной "$flag" булевскому значению "true") по конструкции "if-else", в теле которого мы объявляем вывод в браузер текста 'да' в случае удовлетворения условию цикла, иначе - 'нет' (СПОСОБ АВТОРА):
	$arr = [1, 2, 3, 3, 4, 5, 5];
	$flag = false;
	foreach ($arr as $key=>$elem) {
		if ($key > 0 and $elem == $arr[$key - 1]) {
			$flag = true;
			break;
		}
	}
	if ($flag == true) {
		echo 'да';
	} else {
		echo 'нет';
	}
	
</body>
</html>