<!DOCTYPE html>
<html lang="ru">
<head>
	<title>Задачи на конструкции if-else, switch-case в PHP</title>
	<meta charset="utf-8">
</head>
<body>

<?php

	// объявляем переменную "$a", в которую записываем значение "1", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной - "0", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if ($a == 0) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем значение "1", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной больше числа "0", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if ($a > 0) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем значение "1", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной меньше числа "0", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if ($a < 0) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем значение "1", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной больше или равно числу "0", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if ($a >= 0) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем значение "1", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной меньше или равно числу "0", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if ($a <= 0) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем значение "1", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной не равно числу "0", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if ($a != 0) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем строковое значение 'test', после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной соответствует строковому значению 'test', то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 'test';
	if ($a == 'test') {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем строковое значение '1' (строка, содержащая число), после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной эквивалентно (строго соответствует) числовому значению "1", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = '1';
	if ($a === 1) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем строковое значение '' (пустая строка), после чего объявляем условие по конструкции "if-else", в котором, если данная переменная пустует, то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = '';
	if (empty($a)) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем строковое значение '' (пустая строка), после чего объявляем условие по конструкции "if-else", в котором, если данная переменная НЕ пустует, то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = '';
	if (!empty($a)) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем числовое значение "3", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная существует, то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 3;
	if (isset($a)) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем числовое значение "1", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная НЕ существует, то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	if (!isset($a)) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$var", в которую записываем булевое (логическое) значение "true", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная соответствует значению "true", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно' (ДЛИННАЯ ФОРМА ЗАПИСИ):
	$var = true;
	if ($var == true) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$var", в которую записываем булевое (логическое) значение "true", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная соответствует значению "true", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно' (КОРОТКАЯ ФОРМА ЗАПИСИ):
	$var = true;
	if ($var) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$var", в которую записываем булевое (логическое) значение "true", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная НЕ соответствует значению "true", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно' (ДЛИННАЯ ФОРМА ЗАПИСИ):
	$var = true;
	if ($var != true) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$var", в которую записываем булевое (логическое) значение "true", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная НЕ соответствует значению "true", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно' (КОРОТКАЯ ФОРМА ЗАПИСИ):
	$var = true;
	if (!$var) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем числовое значение "5", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная больше числового значения "0" И меньше числового значения "5", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 5;
	if ($a > 0 && $a < 5) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$a", в которую записываем числовое значение "5", после чего объявляем условие по конструкции "if-else", в котором, если данная переменная соответствует числовому значению "0" ИЛИ "2", то мы выводим в браузер числовое значение, большее данной переменной на 7 числовых единиц, а иначе - меньшее в 10 раз:
	$a = 5;
	if ($a == 0 || $a == 2) {
		$a += 7;
	} else {
		$a /= 10;
	}
	echo $a;
	
	// объявляем переменные "$a" и "$b", в которые записываем числовые значения "1" и "3" соответственно, после чего объявляем условие по конструкции "if-else", в котором, если переменная "$a" меньше или равна числовому значению "1" И переменная "$b" больше или равна числовому значению "3", то мы выводим в браузер сумму этих значений, а иначе - разность:
	$a = 1;
	$b = 3;
	if ($a <= 1 && $b >= 3) {
		echo $a + $b;
	} else {
		echo $a - $b;
	}
	
	// объявляем переменные "$a" и "$b", в которые записываем числовые значения "1" и "4" соответственно, после чего объявляем условие по конструкции "if-else", в котором, если значение переменной "$a" больше числового значения "2" И меньше числового значения "11" или значение переменной "$b" больше или равно числовому значению "6" И меньше числового значения "14", то мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$a = 1;
	$b = 4;
	if (($a > 2 && $a < 11) || ($b >= 6 && $b < 14)) {
		echo 'Верно';
	} else {
		echo 'Неверно';
	}
	
	// объявляем переменную "$num", в которую записываем числовое значение "2", после чего объявляем условие по конструкции "switch-case", в котором, если значение данной переменной соответствует числовому значению "1", то в новую объявленную переменную "$result" мы записываем значение 'зима', если "2" - то 'весна', а если "3" - то 'лето', если "4", то 'осень', после чего в браузер выводим значение переменной "$result" в соответствии со значением переменной "$num":
	мы выводим в браузер строку 'Верно', а иначе - 'Неверно':
	$num = 2;
	switch ($num) {
		case 1:
			$result = 'зима';
		break;
		case 2:
			$result = 'весна';
		break;
		case 3:
			$result = 'лето';
		break;
		case 4:
			$result = 'осень';
		break;
	}
	echo $result;
	
	// объявляем переменную "$day", в которую записываем числовое значение "12", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной меньше или равно числовому значению "10", то в новую объявленную переменную "$decade" мы записываем числовое значение "1", если значение данной переменной больше или равно числовому значению "11" и меньше или равно числовому значению "20", то в новую объявленную переменную "$decade" мы записываем числовое значение "2", если значение данной переменной больше или равно числовому значению "21" и меньше или равно числовому значению "31", то в новую объявленную переменную "$decade" мы записываем числовое значение "3", после чего в браузер выводим значение переменной "$decade" в соответствии со значением переменной "$day":
	$day = 12;
	if ($day <= 10) {
		$decade = 1;
	}
	if ($day >= 11 && $day <= 20) {
		$decade = 2;
	}
	if ($day >= 21 && $day <= 31) {
		$decade = 3;
	}
	echo $decade;
	
	// объявляем переменную "$month", в которую записываем числовое значение "6", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной соответствует числовому значению "12" ИЛИ "1" ИЛИ "2", то в новую объявленную переменную "$result" мы записываем строковое значение 'Зима', если значение данной переменной больше или равно числовому значению "3" И меньше или равно числовому значению "5", то в новую объявленную переменную "$result" мы записываем строковое значение 'Весна', если значение данной переменной больше или равно числовому значению "6" И меньше или равно числовому значению "8", то в новую объявленную переменную "$result" мы записываем строковое значение 'Лето', если значение данной переменной больше или равно числовому значению "9" И меньше или равно числовому значению "11", то в новую объявленную переменную "$result" мы записываем строковое значение 'Осень', после чего в браузер выводим значение переменной "$result" в соответствии со значением переменной "$month":
	$month = 6;
	if ($month == 12 || $month == 1 || $month == 2) {
		$result = 'Зима';
	}
	if ($month >= 3 && $month <= 5) {
		$result = 'Весна';
	}
	if ($month >= 6 && $month <= 8) {
		$result = 'Лето';
	}
	if ($month >= 9 && $month <= 11) {
		$result = 'Осень';
	}
	echo $result;
	
	// объявляем переменную "$year", в которую записываем числовое значение "2000", после чего объявляем условие по конструкции "if-else", в котором, если значение данной переменной делится на число "4" без остатка ИЛИ на число "400" без остатка И, при этом, не делится на число "100" без остатка, то в браузер выводим строку 'Високосный', иначе - 'Не високосный':
	$year = 2000;
	if ($year % 4 == 0 || ($year % 400 == 0 && $year % 100 != 0)) {
		echo 'Високосный';
	} else {
		echo 'Не високосный';
	}
	
	// объявляем переменную "$str", в которую записываем строковое значение 'abcde', после чего объявляем условие по конструкции "if-else", в котором, если значение 1-го символа данного строкового значения соответствует строковому значению 'a', то в браузер выводим строку 'Да', иначе - 'Нет':
	$str = 'abcde';
	if ($str[0] == 'a') {
		echo 'Да';
	} else {
		echo 'Нет';
	}
	
	// объявляем переменную "$str", в которую записываем строковое значение '12345', содержащее число, после чего объявляем условие по конструкции "if-else", в котором, если значение 1-го символа данного строкового значения соответствует строковому значению '1' ИЛИ "2" ИЛИ "3", то в браузер выводим строку 'Да', иначе - 'Нет':
	$str = '12345';
	if ($str[0] == '1' || $str[0] == '2' || $str[0] == '3') {
		echo 'Да';
	} else {
		echo 'Нет';
	}
	
	// объявляем переменную "$str", в которую записываем строковое значение '123', содержащее число, после чего объявляем переменную "$result", в которую записываем сумму всех однозначных чисел, содержащихся в переменной "$str", после чего полученный результат выводим в браузер:
	$str = '123';
	$result = $str[0] + $str[1] + $str[2];
	echo $result;
	
	// объявляем переменную "$str", в которую записываем строковое значение '123231', содержащее число, затем объявляем переменные "$sum1" и "$sum2", в первую из которых записываем сумму первых 3-х однозначных чисел, содержащихся в переменной "$str", а во вторую - сумму оставшихся 3-х однозначных чисел, после чего объявляем условие по конструкции "if-else", в котором, если значение переменной "$sum1" соответствует значению переменной "$sum2", то в браузер выводим строку 'Да', иначе - 'Нет':
	$str = '123231';
	$sum1 = $str[0] + $str[1] + $str[2];
	$sum2 = $str[3] + $str[4] + $str[5];
	if ($sum1 == $sum2) {
		echo 'Да';
	} else {
		echo 'Нет';
	}
	
?>

</body>
</html>